// Написать программу вычисления функции Аккермана
Console.WriteLine("Hello, World!");
